# coding: utf-8
# ----------------------------------------------------------------------------------
# 2023/4/19 更新

# ----------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------
import os
from method.Flow import Flow
from method.utils import Logger, NoneChecker

####################################################################################


class main:
    def __init__(self, debug_mode=False):
        self.logger = self.setup_logger(debug_mode=debug_mode)

        # インスタンス
        self.flow = Flow()

####################################################################################
# ----------------------------------------------------------------------------------

# Loggerセットアップ

    def setup_logger(self, debug_mode=False):
        debug_mode = os.getenv('DEBUG_MODE', 'False') == 'True'
        logger_instance = Logger(__name__, debug_mode=debug_mode)
        return logger_instance.get_logger()


# ----------------------------------------------------------------------------------
#* 非同期処理が完成するまで利用する

    def main(self):
        self.flow.process()






# ----------------------------------------------------------------------------------
#! 非同期処理が完成したらここに追記して利用



# ----------------------------------------------------------------------------------



# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# テスト実施

if __name__ == '__main__':
    test_flow = Flow()
    test_flow.process()
